SELECT 
    СТУДЕНТЫ.Фамилия, 
    СТУДЕНТЫ.Имя, 
    ПРЕДМЕТЫ.Название, 
    ОЦЕНКИ.Оценка,
    CASE
        WHEN CAST(ОЦЕНКИ.Оценка AS INT) >= 9 THEN 'Отлично'
        WHEN CAST(ОЦЕНКИ.Оценка AS INT) >= 7 THEN 'Хорошо'
        WHEN CAST(ОЦЕНКИ.Оценка AS INT) >= 5 THEN 'Удовлетворительно'
        ELSE 'Неудовлетворительно'
    END AS [Оценка_категория]
FROM 
    ОЦЕНКИ 
INNER JOIN 
    СТУДЕНТЫ ON ОЦЕНКИ.ID_студента = СТУДЕНТЫ.ID_студента 
INNER JOIN 
    ПРЕДМЕТЫ ON ОЦЕНКИ.ID_предмета = ПРЕДМЕТЫ.ID_предмета
ORDER BY 
    CAST(ОЦЕНКИ.Оценка AS INT);
