use lab07_db;
go

-- rollup
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	group by rollup (С.Фамилия, П.Название);

-- cube
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	group by cube (С.Фамилия, П.Название);

-- union
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	group by С.Фамилия, П.Название
	union
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	where О.Оценка > '5'
	group by С.Фамилия, П.Название;

-- union all
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	group by С.Фамилия, П.Название
	union all
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	where О.Оценка > '5'
	group by С.Фамилия, П.Название;

-- intersect
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	where О.Оценка > '5'
	group by С.Фамилия, П.Название
	intersect
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	where О.Оценка > '6'
	group by С.Фамилия, П.Название;

-- except
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	where О.Оценка > '5'
	group by С.Фамилия, П.Название
	except
select С.Фамилия, П.Название [Предмет], avg(cast(О.Оценка as int)) [Средняя оценка]
	from СТУДЕНТЫ С
	join ОЦЕНКИ О on С.ID_студента = О.ID_студента
	join ПРЕДМЕТЫ П on О.ID_предмета = П.ID_предмета
	where О.Оценка > '6'
	group by С.Фамилия, П.Название;
