use lab08_db;
go

-- просто представление
create view [08_студенты] as
select id_студента [Код студента], фамилия, имя, отчество, адрес, телефон
from студенты;
go

-- вывод значения
create view [08_количество_предметов] as
select count(id_предмета) [Кол-во предметов]
from предметы;
go

-- представление с проверкой условия
create view [08_оценки] as
select id_оценки [Код оценки], id_студента [Код студента], id_предмета [Код предмета], оценка
from оценки
where оценка >= '5' with check option;
go

-- представление с сортировкой по названию
create view [08_дисциплины] as
select top 100 percent id_предмета [Код], название [Наименование дисциплины]
from предметы
order by название;
go

-- добавление схемабиндинг к выводу значения
alter view [08_количество_предметов] with schemabinding as
select count(dbo.предметы.id_предмета) [Кол-во предметов]
from dbo.предметы;
go

select * from [08_студенты];
select * from [08_оценки];
select * from [08_дисциплины];
select * from [08_количество_предметов];

/*
drop view [08_студенты];
drop view [08_оценки];
drop view [08_дисциплины];
drop view [08_количество_предметов];
*/
