CREATE DATABASE [Ж_MyBase (lab02 var05)];
GO
USE [Ж_MyBase (lab02 var05)];
GO

CREATE TABLE СТУДЕНТЫ (
    ID_студента INT PRIMARY KEY IDENTITY(1,1),
    Фамилия NVARCHAR(50),
    Имя NVARCHAR(50),
    Отчество NVARCHAR(50),
    Адрес NVARCHAR(100),
    Телефон NVARCHAR(20)
);

CREATE TABLE ПРЕДМЕТЫ (
    ID_предмета INT PRIMARY KEY IDENTITY(1,1),
    Название NVARCHAR(100),
    Часы_лекций INT,
    Часы_практических_занятий INT,
    Часы_лабораторных_работ INT
);

CREATE TABLE ОЦЕНКИ (
    ID_оценки INT PRIMARY KEY IDENTITY(1,1),
    ID_студента INT FOREIGN KEY REFERENCES СТУДЕНТЫ(ID_студента),
    ID_предмета INT FOREIGN KEY REFERENCES ПРЕДМЕТЫ(ID_предмета),
    Оценка NVARCHAR(2),
);

CREATE TABLE ПОСЕЩАЕМОСТЬ (
    ID_посещения INT PRIMARY KEY IDENTITY(1,1),
    ID_студента INT FOREIGN KEY REFERENCES СТУДЕНТЫ(ID_студента),
    ID_предмета INT FOREIGN KEY REFERENCES ПРЕДМЕТЫ(ID_предмета),
    Часы_лекций INT,
    Часы_практических_занятий INT,
    Часы_лабораторных_работ INT,
);

INSERT INTO СТУДЕНТЫ (Фамилия, Имя, Отчество, Адрес, Телефон)
VALUES 
('Иванов', 'Иван', 'Иванович', 'ул. Ленина, д. 10', '89001234567'),
('Петров', 'Петр', 'Петрович', 'ул. Пушкина, д. 20', '89007654321'),
('Сидоров', 'Сидор', 'Сидорович', 'ул. Мира, д. 5', '89009876543');

INSERT INTO ПРЕДМЕТЫ (Название, Часы_лекций, Часы_практических_занятий, Часы_лабораторных_работ)
VALUES
('Математика', 40, 20, 10),
('Физика', 30, 15, 15),
('Информатика', 35, 20, 20);

INSERT INTO ОЦЕНКИ (ID_студента, ID_предмета, Оценка)
VALUES 
(1, 1, '8'),
(2, 2, '4'),
(3, 3, '6'),
(1, 2, '10'),
(2, 3, '5');

INSERT INTO ПОСЕЩАЕМОСТЬ (ID_студента, ID_предмета, Часы_лекций, Часы_практических_занятий, Часы_лабораторных_работ)
VALUES 
(1, 1, 40, 20, 10),
(2, 2, 30, 15, 15),
(3, 3, 35, 20, 20),
(1, 2, 30, 15, 10),
(2, 3, 35, 20, 15);

